/*
상수 : 변하지 않는 값 => 돈
		숫자(정수,실수)
			0x7 : 16진수7
			07 : 8진수7
			0b1 : 2진수1
		문자 '~'
		문자열 "~~"

변수 : 변하는값(임시기억장소) => 지갑
 	   첫자가 영문자(가능한한 소문자로)로 시작해야함
 	   그다음 부터는 숫자,영문자 가능
 	   길이에 제한은 없음
 	   사용자 정의어(개발자가 임의대로 붙일수 있는것들)
 	   	클래스/인터페이스명 - 대체적으로 첫글자가 대문자  
 	   	메소드명 - 뒤에 ()가 있음 
 	   	변수이름 - 주로 소문자
 	  
자료형 : 교과서 p.27 , 1217_02번 참조
 	  기본형 - 데이터 그 자체(값)를 기억한다.
 	  		논리형 , 숫자형(byte-short-char(음수기억x)-int-long)
 	  
 	  참조형 - 위치(주소)를 기억한다. 

	* 자바는 자동으로 메모리 정리 기능이 있음
	
	
 */



public class Exam_01 {
	
	public static void main(String[] args) {
		
		float f;
		double d;
		
		f = 3.14f; // 소수점이 들어가면 컴퓨터는 무조건 double형으로 인식해서 float에 안들어감 그래서 뒤에 f를 붙어야함
		d = 3.14;
		
		
		
		

		
		
		
		
	}
	
}
